xvicam/mvp/cyclist/esp32/src/main.cpp
#include <Arduino.h>
#include <cmath>
#if defined(ESP32)
#include <esp32-hal-ledc.h>
#endif
#include <esp_now.h>
#include <esp_wifi.h>
#include <WiFi.h>
#include <NimBLEDevice.h>
#include <esp_sleep.h>

#include "../include/AccGyro.h"
#include "../include/CrashDetector.h"
#include "../include/Gnss.h"

#define BUTTON_PIN 14

// IMU interrupt pin (LSM6DSOX INT1/INT2 wired here)
#define IMU_INT_PIN 4

// External RGB LED pins (R,G,B). You said: GPIO 26, 2, 25
#define RGB_R_PIN 26
#define RGB_G_PIN 13
#define RGB_B_PIN 25
#define batteryPin A2

// Set true if your RGB LED is common-anode (active LOW). False for common-cathode (active HIGH).
constexpr bool RGB_COMMON_ANODE = false;

#if defined(ESP32)
  #define STATUSLED_USE_LEDC_ATTACH 1
#else
  #define STATUSLED_USE_LEDC_ATTACH 0
#endif

namespace statusLed {
    enum class Mode : uint8_t {
        Operating,
        Bonding,
        Crash,
        Configuring,
        Manual
    };

    static Mode mode = Mode::Operating;

    // LEDC PWM setup (avoid visible flicker)
    static constexpr uint32_t kPwmFreqHz = 5000;
    static constexpr uint8_t kPwmResolutionBits = 8; // 0..255

#if STATUSLED_USE_LEDC_ATTACH

#else
    // v2 and older: fixed channels and explicit setup
    static constexpr uint8_t kChR = 0;
    static constexpr uint8_t kChG = 1;
    static constexpr uint8_t kChB = 2;
#endif

    static inline uint8_t applyPolarity(uint8_t v) {
        return RGB_COMMON_ANODE ? static_cast<uint8_t>(255 - v) : v;
    }

    static void writeRgb(uint8_t r, uint8_t g, uint8_t b) {
#if STATUSLED_USE_LEDC_ATTACH
        ledcWrite(RGB_R_PIN, applyPolarity(r));
        ledcWrite(RGB_G_PIN, applyPolarity(g));
        ledcWrite(RGB_B_PIN, applyPolarity(b));
#else
        ledcWrite(kChR, applyPolarity(r));
        ledcWrite(kChG, applyPolarity(g));
        ledcWrite(kChB, applyPolarity(b));
#endif
    }
    // Returns a smooth 0–255 brightness using a cubic sine curve within the
    // "on" window of each period. Applying a power of 3 (cubic) matches human
    // visual perception of brightness much better, keeping the LED in the
    // soft/medium brightness stages longer and avoiding harsh peaks.
    static uint8_t phaseFade(uint32_t nowMs, uint32_t periodMs, uint8_t dutyPct) {
        if (periodMs == 0) return 0;
        const uint32_t onMs = (static_cast<uint64_t>(periodMs) * dutyPct) / 100;
        if (onMs == 0) return 0;
        const uint32_t pos = nowMs % periodMs;
        if (pos >= onMs) return 0;
        // Sine curve: 0 → 1 → 0 over the on-window
        const float t = static_cast<float>(pos) / static_cast<float>(onMs);
        const float sinVal = sinf(t * 3.14159265f);
        // Cubing the sine value provides a beautiful, premium breathing/fading curve
        const float brightness = sinVal * sinVal * sinVal;
        return static_cast<uint8_t>(brightness * 255.0f);
    }

void init() {
#if STATUSLED_USE_LEDC_ATTACH
        ledcAttach(RGB_R_PIN, kPwmFreqHz, kPwmResolutionBits);
        ledcAttach(RGB_G_PIN, kPwmFreqHz, kPwmResolutionBits);
        ledcAttach(RGB_B_PIN, kPwmFreqHz, kPwmResolutionBits);
#else
        ledcSetup(kChR, kPwmFreqHz, kPwmResolutionBits);
        ledcSetup(kChG, kPwmFreqHz, kPwmResolutionBits);
        ledcSetup(kChB, kPwmFreqHz, kPwmResolutionBits);

        ledcAttachPin(RGB_R_PIN, kChR);
        ledcAttachPin(RGB_G_PIN, kChG);
        ledcAttachPin(RGB_B_PIN, kChB);
#endif

        writeRgb(0, 0, 0);
    }
    void setMode(Mode m) {
        mode = m;
    }

    void update(uint32_t nowMs) {
        // All modes now use smooth cubic sine-curve fading (gamma-corrected).
        // - Bonding:     blue beautiful breath (1000ms period, 100% duty)
        // - Operating:   green pulse           (2s period, gentle)
        // - Crash:       red breathe           (500ms period, 50% duty)
        // - Configuring: cyan breathe          (1s period, 50% duty)
        // - Manual:      magenta pulse         (600ms period, 50% duty)
        switch (mode) {
            case Mode::Bonding: {
                const uint8_t b = phaseFade(nowMs, 1000, 100); // 1s continuous premium breath
                writeRgb(0, 0, b);
                break;
            }
            case Mode::Operating: {
                const uint8_t b = phaseFade(nowMs, 2000, 20); // wider duty so the soft pulse is visible
                writeRgb(0, b, 0);
                break;
            }
            case Mode::Crash: {
                const uint8_t b = phaseFade(nowMs, 500, 50);
                writeRgb(b, 0, 0);
                break;
            }
            case Mode::Configuring: {
                const uint8_t b = phaseFade(nowMs, 1000, 50);
                writeRgb(0, b, b);
                break;
            }
            case Mode::Manual: {
                const uint8_t b = phaseFade(nowMs, 600, 50);
                writeRgb(static_cast<uint8_t>((b * 200) / 255), 0, b);
                break;
            }
        }
    }
}

namespace sys {
    bool isBonding = false;
    bool bondingCompleteFlag = false;
    uint32_t bondingStartTime = 0;

    bool isConfiguring = false;
    uint32_t configuringStartTime = 0;

    bool isCrashed = false;
    crash::CrashEvent lastCrash;
    ImuOrientation lastCrashOrientation;
    uint32_t crashModeStartTime = 0;
    bool crashNotificationAcknowledged = false;

    bool isManual = false;
    uint8_t manualAlertIndex = 0;
    uint32_t manualLastBroadcastMs = 0;

    bool useStaticGps = false;
    bool useStaticImu = false;
    bool useStaticSpeed = false;
    bool useStaticHeading = false;
    float staticLat = 52.4862f, staticLng = -1.8904f, staticAlt = 150.0f;
    float staticAx = 0.0f, staticAy = 0.0f, staticAz = 9.81f;
    float staticGx = 0.0f, staticGy = 0.0f, staticGz = 0.0f;
    float staticSpeed = 10.0f, staticHeading = 90.0f;

    bool anyStaticEnabled() {
        return useStaticGps || useStaticImu || useStaticSpeed || useStaticHeading;
    }

    void enterBonding();
    void enterOperating();
    void enterConfiguring();
    void enterManual();
    void enterCrashMode(const crash::CrashEvent& ev, const ImuOrientation& o);

