xvicam/mvp/cyclist/esp32/src/main.cpp
}

// Forward declarations (used by power manager before full namespace definitions)
namespace ble {
    void stopAdvertising();
}

namespace espNow {
    uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    esp_now_peer_info_t peerInfo;
    uint32_t lastSendMs = 0;
    // Store the most recent IMU sample for broadcast
    ImuSample lastImuSample{};
    gnss::Fix previousFix{};
    gnss::Fix headingRefFix{};
    uint32_t previousFixAtMs = 0;
    float lastGnssSpeedMps = 0.0f;
    uint32_t lastGnssSpeedAtMs = 0;
    float lastImuSpeedMps = 0.0f;
    float lastHeadingDeg = 0.0f;
    uint32_t lastImuUpdateMs = 0;
    float lastImuAccelMps2 = 0.0f;
    bool lastImuMoving = false;
    constexpr uint32_t kSendPeriodMs = 250;
    uint32_t messageCounter = 0;
    bool isInitialised = false;
    static double haversineMeters(double lat1Deg, double lon1Deg, double lat2Deg, double lon2Deg) {
        constexpr double kPi = 3.14159265358979323846;
        constexpr double kEarthRadiusM = 6371000.0;
        const double lat1 = lat1Deg * kPi / 180.0;
        const double lon1 = lon1Deg * kPi / 180.0;
        const double lat2 = lat2Deg * kPi / 180.0;
        const double lon2 = lon2Deg * kPi / 180.0;
        const double dLat = lat2 - lat1;
        const double dLon = lon2 - lon1;
        const double a = std::sin(dLat * 0.5) * std::sin(dLat * 0.5) +
                         std::cos(lat1) * std::cos(lat2) * std::sin(dLon * 0.5) * std::sin(dLon * 0.5);
        const double c = 2.0 * std::atan2(std::sqrt(a), std::sqrt(1.0 - a));
        return kEarthRadiusM * c;
    }

    static bool computeGnssSpeedMps(const gnss::Fix &currentFix, float &outSpeedMps, uint32_t &outAgeMs) {
        if (!currentFix.valid || !previousFix.valid) return false;
        if (currentFix.updatedAtMs == 0 || previousFix.updatedAtMs == 0) return false;
        if (currentFix.updatedAtMs <= previousFix.updatedAtMs) return false;

        const uint32_t dtMs = currentFix.updatedAtMs - previousFix.updatedAtMs;
        outAgeMs = millis() - currentFix.updatedAtMs;
        if (dtMs < 200 || dtMs > 5000) return false;

        const double distM = haversineMeters(previousFix.latDeg, previousFix.lngDeg, currentFix.latDeg, currentFix.lngDeg);
        const float speedMps = static_cast<float>(distM / (static_cast<double>(dtMs) / 1000.0));

        if (speedMps < 0.0f) return false;
        const float kMaxSpeedMps = 60.0f; // sanity cap
        outSpeedMps = (speedMps > kMaxSpeedMps) ? kMaxSpeedMps : speedMps;
        return true;
    }

    void updateImuSpeed(uint32_t nowMs, const ImuOrientation &o) {
        constexpr float kNoiseFloorMps2 = 0.15f;
        constexpr float kLeakPerSecMoving = 0.45f;
        constexpr float kLeakPerSecStill = 1.6f;
        constexpr float kMaxSpeedMps = 40.0f;

        if (lastImuUpdateMs == 0) {
            lastImuUpdateMs = nowMs;
            lastImuSpeedMps = 0.0f;
            lastImuAccelMps2 = o.accelMagHp;
            lastImuMoving = o.isMoving;
            return;
        }

        const uint32_t dtMs = nowMs - lastImuUpdateMs;
        if (dtMs == 0 || dtMs > 1000) {
            lastImuUpdateMs = nowMs;
            lastImuAccelMps2 = o.accelMagHp;
            lastImuMoving = o.isMoving;
            return;
        }

        const float dt = static_cast<float>(dtMs) / 1000.0f;
        const float leak = o.isMoving ? kLeakPerSecMoving : kLeakPerSecStill;
        lastImuSpeedMps *= std::exp(-leak * dt);

        float accel = std::fabs(o.accelMagHp);
        if (accel < kNoiseFloorMps2) accel = 0.0f;
        lastImuSpeedMps += accel * dt;

        if (lastImuSpeedMps < 0.0f) lastImuSpeedMps = 0.0f;
        if (lastImuSpeedMps > kMaxSpeedMps) lastImuSpeedMps = kMaxSpeedMps;

        lastImuUpdateMs = nowMs;
        lastImuAccelMps2 = o.accelMagHp;
        lastImuMoving = o.isMoving;
    }

    namespace led {
        uint32_t offAtMs = 0;

        void init() {
            pinMode(LED_BUILTIN, OUTPUT);
            digitalWrite(LED_BUILTIN, LOW);
        }

        void pulse(uint32_t durationMs) {
            digitalWrite(LED_BUILTIN, HIGH);
            offAtMs = millis() + durationMs;
        }

        void update() {
            if (offAtMs != 0 && millis() >= offAtMs) {
                digitalWrite(LED_BUILTIN, LOW);
                offAtMs = 0;
            }
        }
    }

    void initSerialAndLed() {
        Serial.begin(115200);
        led::init();
    }

    bool initEspNow() {
        WiFi.mode(WIFI_STA);
        esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_LR);
        esp_wifi_set_max_tx_power(78);

        if (esp_now_init() != ESP_OK) return false;

        memset(&peerInfo, 0, sizeof(peerInfo));
        memcpy(peerInfo.peer_addr, broadcastAddress, 6);
        peerInfo.channel = 0;
        peerInfo.encrypt = false;

        if (esp_now_add_peer(&peerInfo) != ESP_OK) return false;

        isInitialised = true;
        return true;
    }

    void stopEspNow() {
        if (isInitialised) {
            esp_now_deinit();
            WiFi.mode(WIFI_OFF);
            isInitialised = false;
        }
    }

    void sendEspNowBroadcast() {
        if (!isInitialised) return;

        const gnss::Fix currentFix = gnss::lastFix();
        const bool realGpsValid = gnss::hasFix(3000);

        bool gpsValid;
        double lat, lng, alt;
        if (sys::useStaticGps) {
            gpsValid = true;
            lat = sys::staticLat;
            lng = sys::staticLng;
            alt = sys::staticAlt;
        } else {
            gpsValid = realGpsValid;
            lat = currentFix.latDeg;
            lng = currentFix.lngDeg;
            alt = currentFix.altMeters;
        }

        if (!sys::useStaticGps && gpsValid && currentFix.valid && currentFix.updatedAtMs > previousFix.updatedAtMs) {

            const uint32_t dtMs = currentFix.updatedAtMs - previousFix.updatedAtMs;
            const bool coordsChanged = (currentFix.latDeg != previousFix.latDeg || currentFix.lngDeg != previousFix.lngDeg);

            // Process if coordinates changed OR if enough time has passed to conclude we are stationary.
            if (coordsChanged || dtMs >= 800) {
                // Calculate Speed
                float gnssSpeedMps = 0.0f;
                uint32_t gnssSpeedAgeMs = 0;
                if (computeGnssSpeedMps(currentFix, gnssSpeedMps, gnssSpeedAgeMs)) {
                    lastGnssSpeedMps = gnssSpeedMps;
                    lastGnssSpeedAtMs = millis();
                }

