xvicam/mvp/cyclist/esp32/src/main.cpp
                // Calculate Heading
                // We calculate bearing only over a distance of > 2.5 meters to completely eliminate GPS dither/noise.
                if (!headingRefFix.valid) {
                    headingRefFix = currentFix;
                } else if (coordsChanged) {
                    double distM = haversineMeters(headingRefFix.latDeg, headingRefFix.lngDeg, currentFix.latDeg, currentFix.lngDeg);
                    if (distM > 2.5) { 
                        const double kPi = 3.14159265358979323846;
                        double lat1 = headingRefFix.latDeg * kPi / 180.0;
                        double lon1 = headingRefFix.lngDeg * kPi / 180.0;
                        double lat2 = currentFix.latDeg * kPi / 180.0;
                        double lon2 = currentFix.lngDeg * kPi / 180.0;
                        double dLon = lon2 - lon1;
                        double y = std::sin(dLon) * std::cos(lat2);
                        double x = std::cos(lat1) * std::sin(lat2) - std::sin(lat1) * std::cos(lat2) * std::cos(dLon);
                        double bearing = std::atan2(y, x);
                        bearing = std::fmod((bearing * 180.0 / kPi) + 360.0, 360.0);
                        lastHeadingDeg = static_cast<float>(bearing);
                        
                        headingRefFix = currentFix; // Update our baseline point
                    }
                }

                // Save the fix ONLY when a new one is processed
                previousFix = currentFix;
                previousFixAtMs = millis();
            }
        }

        float speed = 0.0f;
        if (sys::useStaticSpeed) {
            speed = sys::staticSpeed;
        } else if (!sys::useStaticGps && gpsValid && (millis() - lastGnssSpeedAtMs < 3000)) {
            speed = lastGnssSpeedMps;
        } else {
            speed = lastImuSpeedMps;
        }

        float ax, ay, az, gx, gy, gz;
        if (sys::useStaticImu) {
            ax = sys::staticAx; ay = sys::staticAy; az = sys::staticAz;
            gx = sys::staticGx; gy = sys::staticGy; gz = sys::staticGz;
        } else {
            ax = lastImuSample.ax; ay = lastImuSample.ay; az = lastImuSample.az;
            gx = lastImuSample.gx; gy = lastImuSample.gy; gz = lastImuSample.gz;
        }
        float accelMag = std::sqrt(ax*ax + ay*ay + az*az);

        const float headingDeg = sys::useStaticHeading ? sys::staticHeading : lastHeadingDeg;

        char message[256];
        snprintf(message, sizeof(message),
                "{\"mode\":\"gps\",\"lat\":%.7f,\"lng\":%.7f,\"alt\":%.2f,\"ax\":%.2f,\"ay\":%.2f,\"az\":%.2f,\"gx\":%.2f,\"gy\":%.2f,\"gz\":%.2f,\"speed\":%.2f,\"accel\":%.2f,\"heading\":%.2f}",
                gpsValid ? lat : 0.0,
                gpsValid ? lng : 0.0,
                gpsValid ? alt : 0.0,
                ax, ay, az, gx, gy, gz, speed, accelMag, headingDeg);
        esp_now_send(broadcastAddress, reinterpret_cast<const uint8_t *>(message), strlen(message) + 1);
    }

    void sendCrashAlert(uint32_t crashId, float peakDynamicMps2, const ImuOrientation &o) {
        if (!isInitialised) return;
        char message[128];
        snprintf(message, sizeof(message),
                 "CRASH;id=%lu;peakDyn=%.2f;pitch=%.1f;roll=%.1f;orient=%s;moving=%d",
                 static_cast<unsigned long>(crashId),
                 static_cast<double>(peakDynamicMps2),
                 static_cast<double>(o.pitchDeg),
                 static_cast<double>(o.rollDeg),
                 o.orientationLabel,
                 o.isMoving ? 1 : 0);

        if (esp_now_send(broadcastAddress, reinterpret_cast<const uint8_t *>(message), strlen(message) + 1) == ESP_OK) {
            led::pulse(120);
        } else {
            led::pulse(400);
        }
    }
}

namespace imuPrint {
    constexpr uint32_t kPrintPeriodMs = 100;
    uint32_t lastPrintMs = 0;
    bool initialised = false;
    AccGyro imu;

    static void printImuLine(const ImuSample &s, const ImuOrientation &o) {
        Serial.print(";pitchDeg=");
        Serial.print(o.pitchDeg, 2);
        Serial.print(";rollDeg=");
        Serial.print(o.rollDeg, 2);
        Serial.print(";orient=");
        Serial.print(o.orientationLabel);
        Serial.print(";moving=");
        Serial.println(o.isMoving ? 1 : 0);
    }
}

namespace powerMgr {
    // Policy: sleep when still for 2 minutes, wake on IMU interrupt level.
    constexpr uint32_t kStillToSleepMs = 2UL * 60UL * 1000UL; // 2 minutes stillness

    // Wake sources:
    // - IMU interrupt pin
    // - User button

    // Button logic in this project treats a press as HIGH (see loop()).
    constexpr int kButtonWakeLevel = 1; // 1 = HIGH, 0 = LOW

    // IMU interrupt polarity.
    constexpr int kImuWakeLevel = 1; // 1 = HIGH, 0 = LOW
    constexpr bool kImuIntActiveHigh = (kImuWakeLevel == 1);

    // Map existing motion detection (computed in AccGyro) to a still-timer.
    constexpr uint32_t kStillDebounceMs = 3000;

    enum class SleepReason : uint8_t {
        Unknown = 0,
        Button = 1,
        Still = 2
    };

    RTC_DATA_ATTR uint8_t lastSleepReason = static_cast<uint8_t>(SleepReason::Unknown);

    static SleepReason getLastSleepReason() {
        return static_cast<SleepReason>(lastSleepReason);
    }

    static void setLastSleepReason(SleepReason r) {
        lastSleepReason = static_cast<uint8_t>(r);
    }

    uint32_t stillSinceMs = 0;
    uint32_t lastMovingMs = 0;
    bool armed = false;

    static bool eligibleToSleep() {
        // Don’t sleep during bonding or while crashed.
        return (!sys::isBonding) && (!sys::isCrashed) && imuPrint::initialised;
    }

    void initPin() {
        // Keep a defined level while sleeping.
        pinMode(IMU_INT_PIN, (kImuWakeLevel == 0) ? INPUT_PULLUP : INPUT_PULLDOWN);

        pinMode(BUTTON_PIN, (kButtonWakeLevel == 1) ? INPUT_PULLDOWN : INPUT_PULLUP);
    }

    // Forward declaration (used by spurious-wake filter below)
    void enterDeepSleep(const char *reason, SleepReason sleepReason);

    void armImuInterrupt() {
        if (!imuPrint::initialised) return;

        // Route wake-up + inactivity to INT1 by default.
        // 187mg (3 steps) rejects more small vibrations while still waking on real movement.
        const bool ok = imuPrint::imu.configureWakeInactivity(30, 187, true, kImuIntActiveHigh, true);
        Serial.printf("IMU wake/inactivity config: %s (pin=%d level=%d)\n", ok ? "OK" : "FAIL", IMU_INT_PIN, kImuWakeLevel);
    }

    // Ignore EXT0 wake glitches for a short window after boot/wake.
    // This helps when the IMU interrupt line is still settling or latched.
    constexpr uint32_t kIgnoreWakeMs = 800;
    uint32_t ignoreWakeUntilMs = 0;

    // If falsely awake (e.g. IMU line still active but no WU source), go back to sleep.
    static void returnToSleepIfFalseExtWake() {
        const auto cause = esp_sleep_get_wakeup_cause();
        if (cause != ESP_SLEEP_WAKEUP_EXT1) return;
        if (!imuPrint::initialised) return;

        const uint64_t wakeMask = esp_sleep_get_ext1_wakeup_status();
        const bool wokeByButton = (wakeMask & (1ULL << BUTTON_PIN)) != 0;
        if (wokeByButton) return;

        const int pinNow = digitalRead(IMU_INT_PIN);
        const bool pinStillActive = (pinNow == kImuWakeLevel);

