xvicam/mvp/cyclist/esp32/src/main.cpp
        bool wu = false, inact = false;
        (void)imuPrint::imu.readWakeInactivitySources(wu, inact);

        if (pinStillActive && !wu) {
            Serial.printf("Spurious EXT wake (mask=0x%llX imuPinNow=%d active=%d wu=%d inact=%d). Returning to sleep.\n",
                          static_cast<unsigned long long>(wakeMask),
                          pinNow,
                          pinStillActive ? 1 : 0,
                          wu ? 1 : 0,
                          inact ? 1 : 0);
            Serial.flush();
            delay(50);
            enterDeepSleep("spurious EXT", SleepReason::Unknown);
        }
    }

    void enterDeepSleep(const char *reason, SleepReason sleepReason) {
        Serial.printf("Entering deep sleep (%s)\n", reason ? reason : "");

        // Clear any latched IMU interrupt before sleeping.
        if (imuPrint::initialised) {
            bool wu = false, inact = false;
            (void)imuPrint::imu.readWakeInactivitySources(wu, inact);
        }

        const uint32_t waitStartMs = millis();
        bool warned = false;
        while (digitalRead(BUTTON_PIN) == kButtonWakeLevel) {
            if (!warned && (millis() - waitStartMs) > 1000) {
                Serial.println("Waiting for button release before sleep...");
                warned = true;
            }
            delay(10);
        }

        setLastSleepReason(sleepReason);

        Serial.printf("IMU_INT_PIN=%d level now=%d (wakeLevel=%d)\n", IMU_INT_PIN, digitalRead(IMU_INT_PIN), kImuWakeLevel);
        Serial.printf("BUTTON_PIN=%d level now=%d (wakeLevel=%d)\n", BUTTON_PIN, digitalRead(BUTTON_PIN), kButtonWakeLevel);
        Serial.flush();

        // Stop radios cleanly.
        espNow::stopEspNow();
        ble::stopAdvertising();

        const bool buttonOnlyWake = (sleepReason == SleepReason::Button);
        uint64_t wakeMask = (1ULL << BUTTON_PIN);
        if (!buttonOnlyWake) {
            wakeMask |= (1ULL << IMU_INT_PIN);
        }

        if (kImuWakeLevel == 1 || kButtonWakeLevel == 1) {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_HIGH);
        } else {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ALL_LOW);
        }

        // Give BLE/WiFi stacks a moment to quiesce and let Serial flush.
        delay(200);
        esp_deep_sleep_start();
    }

    void onBootPrintWakeReason() {
        const auto cause = esp_sleep_get_wakeup_cause();
        Serial.print("Wake cause: ");
        switch (cause) {
            case ESP_SLEEP_WAKEUP_EXT1: {
                const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
                Serial.printf("EXT1 (mask=0x%llX)", static_cast<unsigned long long>(mask));
                if (mask & (1ULL << BUTTON_PIN)) Serial.print(" [BUTTON]");
                if (mask & (1ULL << IMU_INT_PIN)) Serial.print(" [IMU]");
                Serial.println();
                break;
            }
            case ESP_SLEEP_WAKEUP_TIMER: Serial.println("TIMER"); break;
            case ESP_SLEEP_WAKEUP_UNDEFINED: Serial.println("POWERON/RESET"); break;
            default: Serial.printf("%d\n", static_cast<int>(cause)); break;
        }
    }

    void enforceHoldToWakeFromButtonOrStill() {
        const SleepReason lastReason = getLastSleepReason();
        if (lastReason != SleepReason::Button && lastReason != SleepReason::Still) return;
        if (esp_sleep_get_wakeup_cause() != ESP_SLEEP_WAKEUP_EXT1) return;

        const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
        if ((mask & (1ULL << BUTTON_PIN)) == 0) return;

        constexpr uint32_t kWakeHoldMs = 2000;
        constexpr uint32_t kPollDelayMs = 2;

        if (digitalRead(BUTTON_PIN) != kButtonWakeLevel) {
            Serial.println("Wake hold not detected, returning to sleep...");
            enterDeepSleep("wake hold not met", lastReason);
        }

        const uint32_t startMs = millis();
        const uint32_t deadlineMs = startMs + kWakeHoldMs;

        while (digitalRead(BUTTON_PIN) == kButtonWakeLevel) {
            const uint32_t nowMs = millis();
            if (static_cast<int32_t>(nowMs - deadlineMs) >= 0) {
                Serial.println("Wake hold satisfied.");
                setLastSleepReason(SleepReason::Unknown);
                return;
            }
            delay(kPollDelayMs);
        }

        Serial.println("Wake hold released early, returning to sleep...");
        enterDeepSleep("wake hold not met", lastReason);
    }

    void update(uint32_t nowMs, bool isMoving) {
        if (ignoreWakeUntilMs != 0 && nowMs < ignoreWakeUntilMs) {
            return;
        }
        if (!eligibleToSleep()) {
            armed = false;
            stillSinceMs = 0;
            return;
        }

        if (!armed) {
            armImuInterrupt();
            armed = true;
            lastMovingMs = nowMs;
            stillSinceMs = 0;
        }

        if (isMoving) {
            lastMovingMs = nowMs;
            stillSinceMs = 0;
            return;
        }

        // not moving
        if (stillSinceMs == 0) {
            // require a short debounce interval after last detected movement
            if (nowMs - lastMovingMs >= kStillDebounceMs) {
                stillSinceMs = nowMs;
            }
            return;
        }
        if (nowMs - stillSinceMs >= kStillToSleepMs) {
            enterDeepSleep("still threshold reached", SleepReason::Still);
        }
    }
}

namespace ble {
    static const NimBLEUUID SVC("1b4d9b4b-9d59-4c4a-8ec6-4f0d8d5cc9e1");
    static const NimBLEUUID CHR("1b4d9b4b-9d59-4c4a-8ec6-4f0d8d5cc9e2");

    static NimBLEServer *srv;
    static NimBLECharacteristic *chr;
    static bool hasBonds() { return NimBLEDevice::getNumBonds() > 0; }

    struct SrvCb : NimBLEServerCallbacks {
        void onConnect(NimBLEServer *s, NimBLEConnInfo &connInfo) override {
            Serial.printf("BLE Client Connected! Address: %s, Bonded: %d\n", connInfo.getAddress().toString().c_str(), connInfo.isBonded());
            if (hasBonds() && !NimBLEDevice::isBonded(connInfo.getAddress())) {
                Serial.println("Rejecting unbonded connection.");
                s->disconnect(connInfo.getConnHandle());
            }
        }

        void onDisconnect(NimBLEServer *s, NimBLEConnInfo &connInfo, int reason) override {
            Serial.printf("BLE Client Disconnected! Reason: %d\n", reason);
            if (sys::isBonding) NimBLEDevice::startAdvertising();
        }

