xvicam/mvp/cyclist/esp32/src/main.cpp
        void onAuthenticationComplete(NimBLEConnInfo &connInfo) override {
            if (connInfo.isBonded()) {
                sys::bondingCompleteFlag = true;
            } else if (!connInfo.isEncrypted()) {
                NimBLEDevice::getServer()->disconnect(connInfo.getConnHandle());
            }
        }
    };

    static SrvCb cbs;

    struct ChrCb : NimBLECharacteristicCallbacks {
        void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override {
            std::string val = pCharacteristic->getValue();
            if (val.find("ACK") != std::string::npos) {
                sys::crashNotificationAcknowledged = true;
                Serial.println("Crash notification acknowledged by APP!");
            } else if (sys::isConfiguring) {
                // Per-group toggles
                if (val.find("STATIC_GPS:1") != std::string::npos) {
                    sys::useStaticGps = true;
                    Serial.println("Static GPS ENABLED");
                } else if (val.find("STATIC_GPS:0") != std::string::npos) {
                    sys::useStaticGps = false;
                    Serial.println("Static GPS DISABLED");
                } else if (val.find("STATIC_IMU:1") != std::string::npos) {
                    sys::useStaticImu = true;
                    Serial.println("Static IMU ENABLED");
                } else if (val.find("STATIC_IMU:0") != std::string::npos) {
                    sys::useStaticImu = false;
                    Serial.println("Static IMU DISABLED");
                } else if (val.find("STATIC_SPEED:1") != std::string::npos) {
                    sys::useStaticSpeed = true;
                    Serial.println("Static Speed ENABLED");
                } else if (val.find("STATIC_SPEED:0") != std::string::npos) {
                    sys::useStaticSpeed = false;
                    Serial.println("Static Speed DISABLED");
                } else if (val.find("STATIC_HEADING:1") != std::string::npos) {
                    sys::useStaticHeading = true;
                    Serial.println("Static Heading ENABLED");
                } else if (val.find("STATIC_HEADING:0") != std::string::npos) {
                    sys::useStaticHeading = false;
                    Serial.println("Static Heading DISABLED");
                } else if (val.find("STATIC_VALS:") == 0) {
                    int parsed = sscanf(val.c_str(), "STATIC_VALS:%f,%f,%f,%f,%f,%f,%f,%f,%f,%f,%f",
                                        &sys::staticLat, &sys::staticLng, &sys::staticAlt,
                                        &sys::staticAx, &sys::staticAy, &sys::staticAz,
                                        &sys::staticGx, &sys::staticGy, &sys::staticGz,
                                        &sys::staticSpeed, &sys::staticHeading);
                    Serial.printf("Parsed %d static values\n", parsed);
                } else if (val.find("MODE:OPERATING") != std::string::npos) {
                    Serial.println("App requested switch to OPERATING mode.");
                    sys::enterOperating();
                }
            } else {
                Serial.println("Config command received but not in Configuring Mode. Ignoring.");
            }
        }
    };
    static ChrCb chrCb;

    static bool started = false;

    void init(const char *name) {
        if (started) return;
        NimBLEDevice::init(name);
        NimBLEDevice::setPower(ESP_PWR_LVL_P9);
        NimBLEDevice::setSecurityAuth(true, true, true);
        NimBLEDevice::setSecurityIOCap(BLE_HS_IO_NO_INPUT_OUTPUT);

        srv = NimBLEDevice::createServer();
        srv->setCallbacks(&cbs);

        auto *service = srv->createService(SVC);
        chr = service->createCharacteristic(CHR, NIMBLE_PROPERTY::NOTIFY | NIMBLE_PROPERTY::WRITE);
        chr->setCallbacks(&chrCb);
        static uint32_t v = 0;
        chr->setValue(v);

        started = true;

        // Start the service once here so it's available when we advertise.
        service->start();
    }

    void startAdvertising(bool isBonding) {
        auto *adv = NimBLEDevice::getAdvertising();
        adv->stop();
        adv->reset();

        // Service UUID goes in the main advertising packet so Android scan filters pick it up.
        adv->addServiceUUID(SVC);

        // Device name goes in the scan response to avoid overflowing the 31-byte ad packet.
        adv->enableScanResponse(true);
        adv->setName("VICAM");

        // 0x02 = General Discoverable (shows in new devices list)
        // 0 = Non-discoverable (hidden from new devices list)
        adv->setDiscoverableMode(isBonding ? 0x02 : 0);

        adv->start();
        Serial.printf("BLE advertising started (bonding=%d, discoverable=%d)\n", isBonding ? 1 : 0, isBonding ? 1 : 0);
    }

    void stopAdvertising() {
        NimBLEDevice::getAdvertising()->stop();
    }

    void tick(uint32_t nowMs) {
        static uint32_t last = 0;
        if (nowMs - last < 500) return;
        last = nowMs;
        if (srv && srv->getConnectedCount() > 0) {
        }
    }

    void sendCrash(uint32_t crashId, float peakDynamicMps2, const ImuOrientation &o) {
        if (!srv || srv->getConnectedCount() == 0) {
            return;
        }
        char message[256];

        const gnss::Fix fix = gnss::lastFix();
        const bool gpsValid = gnss::hasFix(3000);
        const uint32_t gpsAgeMs = fix.updatedAtMs == 0 ? 0 : (millis() - fix.updatedAtMs);

        // Keep JSON backwards compatible by always including gps.lat/lng, but add gps.valid/age/sats.
        const double lat = gpsValid ? fix.latDeg : 0.0;
        const double lng = gpsValid ? fix.lngDeg : 0.0;
        snprintf(message, sizeof(message),
                 "{\"type\":\"crash\",\"crashId\":%lu,\"peakDyn\":%.2f,\"pitch\":%.1f,\"roll\":%.1f,\"orient\":\"%s\",\"moving\":%s,\"gps\":{\"lat\":%.7f,\"lng\":%.7f,\"valid\":%s,\"ageMs\":%lu,\"satsUsed\":%u}}",
                 static_cast<unsigned long>(crashId),
                 static_cast<double>(peakDynamicMps2),
                 static_cast<double>(o.pitchDeg),
                 static_cast<double>(o.rollDeg),
                 o.orientationLabel,
                 o.isMoving ? "true" : "false",
                 static_cast<double>(lat),
                 static_cast<double>(lng),
                 gpsValid ? "true" : "false",
                 static_cast<unsigned long>(gpsAgeMs),
                 static_cast<unsigned int>(fix.satsUsed));

        chr->setValue(reinterpret_cast<uint8_t *>(message), strlen(message));
        chr->notify();
    }
}

namespace sys {
    void enterBonding() {
        isBonding = true;
        isConfiguring = false;
        bondingStartTime = millis();
        espNow::stopEspNow();
        ble::startAdvertising(true);
        statusLed::setMode(statusLed::Mode::Bonding);
        Serial.println("Entered Bonding Mode.");
    }

    void enterConfiguring() {
        isConfiguring = true;
        isBonding = false;
        configuringStartTime = millis();
        espNow::stopEspNow();
        ble::startAdvertising(false); // Non-discoverable
        statusLed::setMode(statusLed::Mode::Configuring);
        Serial.println("Entered Configuring Mode. BLE enabled (non-discoverable).");
    }

    void enterOperating() {
        isBonding = false;
        isConfiguring = false;
        isCrashed = false;
        isManual = false;
        crashNotificationAcknowledged = false;
        ble::stopAdvertising();
        espNow::initEspNow();
        espNow::lastSendMs = millis();
        statusLed::setMode(statusLed::Mode::Operating);
        Serial.println("Entered Operating Mode. WiFi enabled.");
    }

    void enterCrashMode(const crash::CrashEvent& ev, const ImuOrientation& o) {
        isCrashed = true;
        isManual = false;
        crashModeStartTime = millis();
        crashNotificationAcknowledged = false;
        lastCrash = ev;
        lastCrashOrientation = o;
        espNow::stopEspNow();
        ble::startAdvertising(false);
        statusLed::setMode(statusLed::Mode::Crash);
        Serial.println("CRASH DETECTED! Switched to BLE Mode.");
    }

    void enterManual() {
        isBonding = false;
        isConfiguring = false;
        isCrashed = false;
        isManual = true;
        manualAlertIndex = 0;
        manualLastBroadcastMs = 0;
        crashNotificationAcknowledged = false;
        ble::stopAdvertising();
        espNow::initEspNow();
        statusLed::setMode(statusLed::Mode::Manual);
        Serial.println("Entered Manual Mode. Broadcasting static alerts via ESP-NOW.");
    }
}

void setup() {
    espNow::initSerialAndLed();
    powerMgr::initPin();

