xvicam/mvp/cyclist/esp32/src/main.cpp
    statusLed::init();

    ble::init("VICAM");

    const bool gnssOk = gnss::init();
    Serial.println(gnssOk ? "GNSS init OK" : "GNSS init FAILED (check wiring/I2C addr)" );

    powerMgr::onBootPrintWakeReason();
    powerMgr::enforceHoldToWakeFromButtonOrStill();

    sys::enterOperating();

    imuPrint::initialised = imuPrint::imu.beginI2C();

    // Configure IMU interrupts as early as possible (required for wake).
    if (imuPrint::initialised) {
        powerMgr::armImuInterrupt();
        // If the user is pressing the button, prevent immediately re-entering sleep.
        powerMgr::ignoreWakeUntilMs = millis() + powerMgr::kIgnoreWakeMs + 700;
        powerMgr::returnToSleepIfFalseExtWake();
    } else {
        Serial.println("IMU init failed; sleep-on-still disabled.");
    }

    analogReadResolution(12);

}

void loop() {
    const uint32_t now = millis();
    espNow::led::update();
    statusLed::update(now);

    gnss::update(now);

    if (!sys::isBonding && !sys::isManual && espNow::isInitialised) {
        if (now - espNow::lastSendMs >= espNow::kSendPeriodMs) {
            espNow::lastSendMs = now;
            espNow::sendEspNowBroadcast();
        }
    }

    // --- Manual Mode: repeatedly broadcast the currently selected alert ---
    if (sys::isManual && espNow::isInitialised) {
        constexpr uint32_t kManualBroadcastIntervalMs = 2000; // repeat every 2s
        if (now - sys::manualLastBroadcastMs >= kManualBroadcastIntervalMs) {
            sys::manualLastBroadcastMs = now;

            // Static JSON alert messages (indexed by manualAlertIndex)
            // 0 = safe_distance  (1 press)
            // 1 = alert_zone     (2 presses)
            // 2 = approaching    (3 presses)
            // 3 = about_to_crash (4 presses)
            static const char* manualAlerts[] = {
                "{\"mode\":\"remote\",\"cri\":0}",
                "{\"mode\":\"remote\",\"cri\":1}",
                "{\"mode\":\"remote\",\"cri\":2}",
                "{\"mode\":\"remote\",\"cri\":3}"
            };

            const char* msg = manualAlerts[sys::manualAlertIndex];
            esp_err_t result = esp_now_send(espNow::broadcastAddress,
                                           reinterpret_cast<const uint8_t*>(msg),
                                           strlen(msg) + 1);
            Serial.printf("[Manual] Broadcasting: %s (%s)\n", msg, result == ESP_OK ? "OK" : "FAIL");
            espNow::led::pulse(80);
        }
    }

    if (Serial.available()) {
        char c = Serial.read();
        if (c == 'C' || c == 'c') {
            ImuOrientation o{};
            o.orientationLabel = "Simulated";

            if (imuPrint::initialised) {
                ImuSample s;
                if (imuPrint::imu.readSample(s)) {
                    espNow::lastImuSample = s;
                    o = imuPrint::imu.computeOrientation(s);
                }
            }

            static uint32_t simCrashId = 1000;
            crash::CrashEvent mockEv;
            mockEv.triggered = true;
            mockEv.crashId = simCrashId++;
            mockEv.peakDynamicMps2 = o.accelMagnitude;

            if (!sys::isCrashed) {
                sys::enterCrashMode(mockEv, o);
                Serial.println("Simulated crash triggered. Switched to BLE Mode.");
            } else {
                Serial.println("Already in crash mode.");
            }
        } else if (c == 'M' || c == 'm') {
            if (!sys::isManual) {
                sys::enterManual();
            } else {
                Serial.println("Exiting Manual Mode, returning to Operating...");
                sys::enterOperating();
            }
        }
    }

    static uint32_t lastPulseMs = 0;
    uint32_t pulseInterval = sys::isBonding ? 250 : 2000;
    if (now - lastPulseMs > pulseInterval) {
        lastPulseMs = now;
        espNow::led::pulse(50);
    }

    static constexpr uint32_t kButtonLongPressMs = 2000;
    static constexpr uint32_t kButtonCrashLongPressMs = 5000;
    static constexpr uint32_t kButtonDoublePressGapMs = 400;
    static constexpr uint32_t kButtonDebounceMs = 30;

    static bool btnPrev = false;
    static uint32_t btnDownAt = 0;
    static uint32_t lastReleaseAt = 0;
    static uint8_t pressCount = 0;
    static bool longPressHandled = false;

    const bool btnNow = (digitalRead(BUTTON_PIN) == HIGH);

    if (btnNow && !btnPrev) {
        btnDownAt = now;
        longPressHandled = false;
    }

    if (!btnNow && btnPrev) {
        const uint32_t heldMs = (btnDownAt != 0) ? (now - btnDownAt) : 0;
        if (!longPressHandled && heldMs >= kButtonDebounceMs) {
            pressCount = static_cast<uint8_t>(pressCount + 1);
            lastReleaseAt = now;
        }
        btnDownAt = 0;
    }

    if (btnNow && !longPressHandled && btnDownAt != 0) {
        const uint32_t holdMs = sys::isManual ? kButtonLongPressMs
                              : sys::isCrashed ? kButtonCrashLongPressMs
                              : kButtonLongPressMs;
        if ((now - btnDownAt) >= holdMs) {
            longPressHandled = true;
            pressCount = 0;
            if (sys::isManual) {
                Serial.println("Button held in manual mode, returning to operating...");
                sys::enterOperating();
            } else {
                Serial.println(sys::isCrashed
                    ? "Button held for 5 seconds in crash mode, entering deep sleep..."
                    : "Button held for 2 seconds, entering deep sleep...");
                powerMgr::enterDeepSleep("button long press", powerMgr::SleepReason::Button);
            }
        }
    }

    if (pressCount > 0 && (now - lastReleaseAt) > kButtonDoublePressGapMs) {
        if (sys::isManual) {
            // In Manual Mode: button presses select the alert level
            // 1 = safe_distance, 2 = alert_zone, 3 = approaching, 4 = about_to_crash
            static const char* alertNames[] = {"safe_distance", "alert_zone", "approaching", "about_to_crash"};
            uint8_t idx = (pressCount >= 4) ? 3 : static_cast<uint8_t>(pressCount - 1);
            sys::manualAlertIndex = idx;
            sys::manualLastBroadcastMs = 0; // trigger immediate broadcast
            Serial.printf("[Manual] Alert set to: %s (%d press%s)\n", alertNames[idx], pressCount, pressCount > 1 ? "es" : "");
        } else if (pressCount >= 4) {
            if (sys::isCrashed) {
                Serial.println("Button quad-press in crash mode, ignoring...");
            } else {
                Serial.println("Button quad-pressed, entering manual mode...");
                sys::enterManual();
            }
        } else if (pressCount == 3) {
            if (sys::isCrashed) {
                Serial.println("Button triple-press in crash mode, ignoring...");
            } else {
                Serial.println("Button triple-pressed, entering configuring mode...");
                sys::enterConfiguring();
            }
        } else if (pressCount == 2) {
            if (sys::isCrashed) {
                Serial.println("Button double-press in crash mode, ignoring bonding request...");
            } else if (!sys::isBonding) {
                Serial.println("Button double-pressed, entering bonding mode...");
                sys::enterBonding();
            } else {
                Serial.println("Button double-pressed, exiting bonding mode...");
                sys::enterOperating();
            }
        }
        pressCount = 0;
    }

