xvicam/mvp/cyclist/esp32/src/main.cpp
    btnPrev = btnNow;

    if (sys::bondingCompleteFlag) {
        sys::bondingCompleteFlag = false;
        sys::enterOperating();
    }

    if (sys::isBonding && (now - sys::bondingStartTime > 120000)) {
        Serial.println("Bonding timeout, entering operating mode...");
        sys::enterOperating();
    }

    if (sys::isConfiguring && (now - sys::configuringStartTime > 120000)) {
        Serial.println("Configuring timeout, entering operating mode...");
        sys::enterOperating();
    }

    if (imuPrint::initialised && (now - imuPrint::lastPrintMs >= imuPrint::kPrintPeriodMs)) {
        imuPrint::lastPrintMs = now;
        ImuSample s;

        if (imuPrint::imu.readSample(s)) {
            espNow::lastImuSample = s;
            const ImuOrientation o = imuPrint::imu.computeOrientation(s);
            espNow::updateImuSpeed(now, o);
            static crash::CrashDetector detector;
            const crash::CrashEvent ev = detector.update(now, s, o);

            if (ev.triggered && !sys::isCrashed) {
                sys::enterCrashMode(ev, o);
            }

            // --- Battery: calibrated multi-sample average ---
            // analogReadMilliVolts() uses the factory Vref calibration
            // stored in this chip's eFuse for accurate readings.
            constexpr int kBatSamples = 32;
            uint32_t mvSum = 0;
            for (int i = 0; i < kBatSamples; i++) {
                mvSum += analogReadMilliVolts(batteryPin);
            }
            float mvAvg = static_cast<float>(mvSum) / kBatSamples;
            float voltage = (mvAvg / 1000.0f) * 2.0f;  // ×2 for onboard voltage divider

            // LiPo discharge curve lookup table (voltage -> percentage)
            // Based on a typical single-cell LiPo discharge profile.
            static const float lutV[] = {
                4.20f, 4.15f, 4.10f, 4.05f, 4.00f,
                3.95f, 3.90f, 3.85f, 3.80f, 3.75f,
                3.70f, 3.65f, 3.60f, 3.55f, 3.50f,
                3.45f, 3.40f, 3.35f, 3.30f, 3.20f,
                3.00f
            };
            static const float lutP[] = {
                100.0f, 97.0f, 93.0f, 88.0f, 83.0f,
                 78.0f, 72.0f, 62.0f, 52.0f, 42.0f,
                 33.0f, 24.0f, 17.0f, 12.0f,  8.0f,
                  5.0f,  3.0f,  1.5f,  1.0f,  0.0f,
                  0.0f
            };
            constexpr int lutLen = sizeof(lutV) / sizeof(lutV[0]);

            float percentage;
            if (voltage >= lutV[0]) {
                percentage = 100.0f;
            } else if (voltage <= lutV[lutLen - 1]) {
                percentage = 0.0f;
            } else {
                // Linear interpolation between LUT points
                for (int i = 0; i < lutLen - 1; i++) {
                    if (voltage >= lutV[i + 1]) {
                        float t = (voltage - lutV[i + 1]) / (lutV[i] - lutV[i + 1]);
                        percentage = lutP[i + 1] + t * (lutP[i] - lutP[i + 1]);
                        break;
                    }
                }
            }

            // Exponential smoothing so the display doesn't jump around
            static float smoothPct = -1.0f;
            if (smoothPct < 0.0f) {
                smoothPct = percentage; // first reading: seed directly
            } else {
                smoothPct = smoothPct * 0.9f + percentage * 0.1f;
            }
            percentage = smoothPct;

            // --- GPS serial ---
            if (sys::useStaticGps) {
                Serial.printf("[S]GPS - Lat: %.7f, Lng: %.7f, Alt: %.2f | ",
                              sys::staticLat, sys::staticLng, sys::staticAlt);
            } else {
                const gnss::Fix fix = gnss::lastFix();
                if (gnss::hasFix(3000)) {
                    Serial.printf("GPS - Lat: %.7f, Lng: %.7f, Alt: %.2f | ", fix.latDeg, fix.lngDeg, fix.altMeters);
                } else {
                    Serial.print("GPS - Waiting for fix... | ");
                }
            }

            // --- IMU serial ---
            if (sys::useStaticImu) {
                Serial.printf("[S]Accel: %.2f,%.2f,%.2f | [S]Gyro: %.2f,%.2f,%.2f | ",
                              sys::staticAx, sys::staticAy, sys::staticAz,
                              sys::staticGx, sys::staticGy, sys::staticGz);
            } else {
                imuPrint::printImuLine(s, o);
            }

            // --- Speed & Heading serial ---
            if (sys::useStaticSpeed) {
                Serial.printf("[S]Speed: %.2f | ", sys::staticSpeed);
            } else {
                const bool gpsValidForSpeed = gnss::hasFix(3000) && (millis() - espNow::lastGnssSpeedAtMs < 3000);
                Serial.printf("Speed: %.2f | ", gpsValidForSpeed ? espNow::lastGnssSpeedMps : espNow::lastImuSpeedMps);
            }
            if (sys::useStaticHeading) {
                Serial.printf("[S]Heading: %.2f | ", sys::staticHeading);
            } else {
                Serial.printf("Heading: %.2f | ", espNow::lastHeadingDeg);
            }

            Serial.printf("Voltage: %.2fV | Pct: %.1f%%\n", voltage, percentage);

            powerMgr::update(now, o.isMoving);
        }
    }

    if (sys::isCrashed) {
        if (sys::crashNotificationAcknowledged || (millis() - sys::crashModeStartTime > 120000)) {
            Serial.println("Crash mode ended (ACK received or timeout). Returning to operating mode...");
            sys::enterOperating();
        } else {
            static uint32_t lastCrashSend = 0;
            if (now - lastCrashSend > 1000) {
                lastCrashSend = now;
                ble::sendCrash(sys::lastCrash.crashId, sys::lastCrash.peakDynamicMps2, sys::lastCrashOrientation);
            }
        }
    }

    if (sys::isBonding || sys::isConfiguring) ble::tick(now);
}
